# pandas
- pandas 는 데이터 분석과 조작(전처리)를 위한 파이썬 오픈소스 라이브러리
- Series 와 DaataFrame 이라는 데이터 타입을 이용
- 데이터 필터링, 정렬, 그룹화, 결측치처리, 시각화 등

- pandas 데이터 타입
    - Series
        - index, value 로 이루어진 데이터 타입
    - DataFrame
        - index, values, columns 으로 이루어진 데이터 타입
        - Series 데이터가 모이면 DataFrame
        - tabular, table

- 파이썬에서 쓰는 엑셀
- 스테로이드 맞은 엑셀

## 01. Series
- index, values

In [2]:
# !pip install pandas

In [3]:
import numpy as np
import pandas as pd

In [7]:
# 선언
series = pd.Series([1, 2, 3, 4])

In [8]:
type(series)

pandas.core.series.Series

In [9]:
# 오프셋 인덱스
series[0], series[3], series[1:3], type(series[2])

(1,
 4,
 1    2
 2    3
 dtype: int64,
 numpy.int64)

In [10]:
# 시리즈 내부 데이터 타입
pd.Series([1, 2, 3], dtype = np.float64)

0    1.0
1    2.0
2    3.0
dtype: float64

In [12]:
# 한 가지 데이터 타입만 인식
# object는 문자열 데이터를 의미
# 왼쪽은 인덱스 오른쪽은 값들로 이루어짐
li = [1, 2, 3, '4']
pd.Series(li)

0    1
1    2
2    3
3    4
dtype: object

In [15]:
series.index, series.values

(RangeIndex(start=0, stop=4, step=1), array([1, 2, 3, 4]))

In [19]:
# 형변환
series = series.astype(np.float64) ## 새롭게 할당해주어야 형변환이 됨

series

- index 설정

In [24]:

data = pd.Series(np.random.randint(10, size = 5), list('ABCDE'))

In [25]:
data

A    3
B    5
C    9
D    3
E    2
dtype: int64

data['A']

In [26]:
data["A"]

3

In [29]:
data.A, data[["A", "B", "C"]]

(3,
 A    3
 B    5
 C    9
 dtype: int64)

In [28]:
data

A    3
B    5
C    9
D    3
E    2
dtype: int64

- 조건에 맞는 값들만 추려내고 싶을 때

In [34]:

data[data > 5]

C    9
dtype: int64

In [32]:
data > 5

A    False
B    False
C     True
D    False
E    False
dtype: bool

- 조건에 맞는 값들을 새롭게 할당도 가능하다

In [38]:
data[data > 5 ] = 999

In [39]:

data

A      3
B      5
C    999
D      3
E      2
dtype: int64

In [40]:
# 브로드 캐스팅 연산
data * 100

A      300
B      500
C    99900
D      300
E      200
dtype: int64

## 02. DataFrame
- Series()
    - index, values
- DataFrame()
    - index, values, columns

In [50]:
dates = pd.date_range('20230804', periods = 6)

In [51]:
pd.DataFrame(data = [1, 2, 3, 4])

   0
0  1
1  2
2  3
3  4

pd.DataFrame(data = 안에 들어가는 값들, columns = 열 정보, index = 인덱스 )

In [138]:
df = pd.DataFrame(data = np.random.randn(6, 4), 
             columns = ['A', 'B', 'C', 'D'],
             index = dates)

In [139]:
df

                   A         B         C         D
2023-08-04 -1.380659  0.144631  1.898931  0.688993
2023-08-05 -0.734541  0.559971 -0.342490  0.082496
2023-08-06  0.324920  1.635320  0.157321 -1.475597
2023-08-07  0.635575 -0.430651 -0.454975  1.583368
2023-08-08 -0.388897 -1.549326 -2.274574 -1.014404
2023-08-09  0.280633 -0.300134  1.085409 -0.538089

In [140]:
# 데이터 프레임 상단 정보 확인
df.head()

                   A         B         C         D
2023-08-04 -1.380659  0.144631  1.898931  0.688993
2023-08-05 -0.734541  0.559971 -0.342490  0.082496
2023-08-06  0.324920  1.635320  0.157321 -1.475597
2023-08-07  0.635575 -0.430651 -0.454975  1.583368
2023-08-08 -0.388897 -1.549326 -2.274574 -1.014404

In [141]:
# 데이터 프레임 하단 정보 확인
df.tail(10)

                   A         B         C         D
2023-08-04 -1.380659  0.144631  1.898931  0.688993
2023-08-05 -0.734541  0.559971 -0.342490  0.082496
2023-08-06  0.324920  1.635320  0.157321 -1.475597
2023-08-07  0.635575 -0.430651 -0.454975  1.583368
2023-08-08 -0.388897 -1.549326 -2.274574 -1.014404
2023-08-09  0.280633 -0.300134  1.085409 -0.538089

In [142]:
# 데이터 프레임 기본 정보 요약
# 이거부터 먼저 보고 작업한다
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2023-08-04 to 2023-08-09
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 412.0 bytes

In [143]:
# 데이터 프레임 기술통계 정보 요약
# 숫자 데이터에 한해서만 보여줌
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.210495  0.009969  0.011604 -0.112206
std    0.764126  1.066219  1.435687  1.132164
min   -1.380659 -1.549326 -2.274574 -1.475597
25%   -0.648130 -0.398022 -0.426854 -0.895325
50%   -0.054132 -0.077752 -0.092584 -0.227796
75%    0.313848  0.456136  0.853387  0.537369
max    0.635575  1.635320  1.898931  1.583368

In [144]:
# 데이터 프레임 구성 3요소
df.index

DatetimeIndex(['2023-08-04', '2023-08-05', '2023-08-06', '2023-08-07',
               '2023-08-08', '2023-08-09'],
              dtype='datetime64[ns]', freq='D')

In [145]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

- data로 입력한 값들을 df.values로 확인할 수 있다.

In [146]:
df.values

array([[-1.38065924,  0.14463077,  1.89893119,  0.68899278],
       [-0.73454059,  0.55997057, -0.34248993,  0.0824957 ],
       [ 0.32492034,  1.63532033,  0.15732102, -1.47559742],
       [ 0.63557529, -0.43065076, -0.45497525,  1.58336846],
       [-0.38889717, -1.5493258 , -2.27457381, -1.01440407],
       [ 0.2806328 , -0.30013401,  1.08540859, -0.53808866]])

In [147]:
df.A # 데이터 타입을 series로 보여줌 시리즈가 모인게 df
     # frequency로 Day의 약자로 주기를 의미함

2023-08-04   -1.380659
2023-08-05   -0.734541
2023-08-06    0.324920
2023-08-07    0.635575
2023-08-08   -0.388897
2023-08-09    0.280633
Freq: D, Name: A, dtype: float64

In [148]:
df['B']

2023-08-04    0.144631
2023-08-05    0.559971
2023-08-06    1.635320
2023-08-07   -0.430651
2023-08-08   -1.549326
2023-08-09   -0.300134
Freq: D, Name: B, dtype: float64

In [149]:
df[['B', 'D']]

                   B         D
2023-08-04  0.144631  0.688993
2023-08-05  0.559971  0.082496
2023-08-06  1.635320 -1.475597
2023-08-07 -0.430651  1.583368
2023-08-08 -1.549326 -1.014404
2023-08-09 -0.300134 -0.538089

In [150]:
# 오프셋 인덱스
# [n:m]
# n부터 m-1

df[0:2]

                   A         B         C         D
2023-08-04 -1.380659  0.144631  1.898931  0.688993
2023-08-05 -0.734541  0.559971 -0.342490  0.082496

In [151]:
df

                   A         B         C         D
2023-08-04 -1.380659  0.144631  1.898931  0.688993
2023-08-05 -0.734541  0.559971 -0.342490  0.082496
2023-08-06  0.324920  1.635320  0.157321 -1.475597
2023-08-07  0.635575 -0.430651 -0.454975  1.583368
2023-08-08 -0.388897 -1.549326 -2.274574 -1.014404
2023-08-09  0.280633 -0.300134  1.085409 -0.538089

In [152]:
df['2023-08-04' : '2023-08-06']

                   A         B         C         D
2023-08-04 -1.380659  0.144631  1.898931  0.688993
2023-08-05 -0.734541  0.559971 -0.342490  0.082496
2023-08-06  0.324920  1.635320  0.157321 -1.475597

In [153]:
# location
# loc

df.loc['2023-08-04' : '2023-08-06', 'A':'C']

                   A         B         C
2023-08-04 -1.380659  0.144631  1.898931
2023-08-05 -0.734541  0.559971 -0.342490
2023-08-06  0.324920  1.635320  0.157321

In [154]:
df.iloc[1:3, 0:2]

                   A         B
2023-08-05 -0.734541  0.559971
2023-08-06  0.324920  1.635320

In [155]:
# 데이터 정렬
# sort_values()
# 오름차순

df

                   A         B         C         D
2023-08-04 -1.380659  0.144631  1.898931  0.688993
2023-08-05 -0.734541  0.559971 -0.342490  0.082496
2023-08-06  0.324920  1.635320  0.157321 -1.475597
2023-08-07  0.635575 -0.430651 -0.454975  1.583368
2023-08-08 -0.388897 -1.549326 -2.274574 -1.014404
2023-08-09  0.280633 -0.300134  1.085409 -0.538089

In [156]:
df.sort_values(by = 'A')

                   A         B         C         D
2023-08-04 -1.380659  0.144631  1.898931  0.688993
2023-08-05 -0.734541  0.559971 -0.342490  0.082496
2023-08-08 -0.388897 -1.549326 -2.274574 -1.014404
2023-08-09  0.280633 -0.300134  1.085409 -0.538089
2023-08-06  0.324920  1.635320  0.157321 -1.475597
2023-08-07  0.635575 -0.430651 -0.454975  1.583368

- ascending = False 는 내림차순으로 가장 큰 값 부터 보여준다
- ascending = True 는 오름차순으로 가장 작은 값 부터 보여준다
- 기본값은 True

In [157]:
df.sort_values(by = 'A', ascending = False)

                   A         B         C         D
2023-08-07  0.635575 -0.430651 -0.454975  1.583368
2023-08-06  0.324920  1.635320  0.157321 -1.475597
2023-08-09  0.280633 -0.300134  1.085409 -0.538089
2023-08-08 -0.388897 -1.549326 -2.274574 -1.014404
2023-08-05 -0.734541  0.559971 -0.342490  0.082496
2023-08-04 -1.380659  0.144631  1.898931  0.688993

- sort value를 2개를 하게 되면 먼저 나온 기준으로 정렬한 뒤
- 같은 값이 나왔을 때 그 뒤에 나온 기준으로 정렬한다

In [158]:
df.sort_values(by = ['A', 'B'], ascending = False)

                   A         B         C         D
2023-08-07  0.635575 -0.430651 -0.454975  1.583368
2023-08-06  0.324920  1.635320  0.157321 -1.475597
2023-08-09  0.280633 -0.300134  1.085409 -0.538089
2023-08-08 -0.388897 -1.549326 -2.274574 -1.014404
2023-08-05 -0.734541  0.559971 -0.342490  0.082496
2023-08-04 -1.380659  0.144631  1.898931  0.688993

- 딕셔너리로 pandas를 만들 경우에는 key값이 columns이 된다

In [159]:
# 데이터를 딕셔너리의 리스트로 생성
data = {
    'A' : [1, 2, 3, 4, 5],
    'B' : [3, 2, 3, 1, 2],
    'C' : [5, 4, 3, 2, 1]
}

In [160]:
sort_study_df = pd.DataFrame(data)

In [161]:
pd.DataFrame(data)

   A  B  C
0  1  3  5
1  2  2  4
2  3  3  3
3  4  1  2
4  5  2  1

In [162]:
# 데이터를 리스트의 딕셔너리로 생성
data = [
    {'A': 1, 'B': 3, 'C': 5},
    {'A': 2, 'B': 2, 'C': 4},
    {'A': 3, 'B': 3, 'C': 3},
    {'A': 4, 'B': 1, 'C': 2},
    {'A': 5, 'B': 2, 'C': 1},
]

In [163]:
pd.DataFrame(data)

   A  B  C
0  1  3  5
1  2  2  4
2  3  3  3
3  4  1  2
4  5  2  1

In [164]:
sort_study_df.sort_values(by = ['B', 'C'])

   A  B  C
3  4  1  2
4  5  2  1
1  2  2  4
2  3  3  3
0  1  3  5

In [165]:
df

                   A         B         C         D
2023-08-04 -1.380659  0.144631  1.898931  0.688993
2023-08-05 -0.734541  0.559971 -0.342490  0.082496
2023-08-06  0.324920  1.635320  0.157321 -1.475597
2023-08-07  0.635575 -0.430651 -0.454975  1.583368
2023-08-08 -0.388897 -1.549326 -2.274574 -1.014404
2023-08-09  0.280633 -0.300134  1.085409 -0.538089

- 컬럼을 추가하기 위해서는 
- df ["columns에 입력하고 싶은 값"] = ['인덱스의 크기에 맞게끔 값을 입력해주는 것이 좋다']

In [166]:
# 컬럼 추가
# 기존에 컬럼이 없으면 추가, 있으면 덮어쓰기
df['E'] = ['one', 'one', 'two', 'three', 'four', 'seven']

In [167]:
df

                   A         B         C         D      E
2023-08-04 -1.380659  0.144631  1.898931  0.688993    one
2023-08-05 -0.734541  0.559971 -0.342490  0.082496    one
2023-08-06  0.324920  1.635320  0.157321 -1.475597    two
2023-08-07  0.635575 -0.430651 -0.454975  1.583368  three
2023-08-08 -0.388897 -1.549326 -2.274574 -1.014404   four
2023-08-09  0.280633 -0.300134  1.085409 -0.538089  seven

- 데이터 삭제
- pandas에서는 axis=1 세로 0은 가로 
- numpy는 반대이다
- inplace = True 는 원본을 진짜 바꾸는 명령어
- df.drop('열 중 하나의 값', 열이면 axis = 1)

In [168]:
# 데이터 삭제
# axis = 1 세로, axis = 0 가로
# inplace 내부 내용을 바꾼다
df.drop('A', axis = 1)

                   B         C         D      E
2023-08-04  0.144631  1.898931  0.688993    one
2023-08-05  0.559971 -0.342490  0.082496    one
2023-08-06  1.635320  0.157321 -1.475597    two
2023-08-07 -0.430651 -0.454975  1.583368  three
2023-08-08 -1.549326 -2.274574 -1.014404   four
2023-08-09 -0.300134  1.085409 -0.538089  seven

In [169]:
df

                   A         B         C         D      E
2023-08-04 -1.380659  0.144631  1.898931  0.688993    one
2023-08-05 -0.734541  0.559971 -0.342490  0.082496    one
2023-08-06  0.324920  1.635320  0.157321 -1.475597    two
2023-08-07  0.635575 -0.430651 -0.454975  1.583368  three
2023-08-08 -0.388897 -1.549326 -2.274574 -1.014404   four
2023-08-09  0.280633 -0.300134  1.085409 -0.538089  seven

In [170]:
df.drop('A', axis = 1, inplace = True)

In [171]:
df

                   B         C         D      E
2023-08-04  0.144631  1.898931  0.688993    one
2023-08-05  0.559971 -0.342490  0.082496    one
2023-08-06  1.635320  0.157321 -1.475597    two
2023-08-07 -0.430651 -0.454975  1.583368  three
2023-08-08 -1.549326 -2.274574 -1.014404   four
2023-08-09 -0.300134  1.085409 -0.538089  seven

In [172]:
df.drop(['2023-08-06', '2023-08-09'], axis = 0)

                   B         C         D      E
2023-08-04  0.144631  1.898931  0.688993    one
2023-08-05  0.559971 -0.342490  0.082496    one
2023-08-07 -0.430651 -0.454975  1.583368  three
2023-08-08 -1.549326 -2.274574 -1.014404   four

In [173]:
df.drop(columns=['B','D'])

                   C      E
2023-08-04  1.898931    one
2023-08-05 -0.342490    one
2023-08-06  0.157321    two
2023-08-07 -0.454975  three
2023-08-08 -2.274574   four
2023-08-09  1.085409  seven

In [174]:
df.drop(index=['2023-08-04'])

                   B         C         D      E
2023-08-05  0.559971 -0.342490  0.082496    one
2023-08-06  1.635320  0.157321 -1.475597    two
2023-08-07 -0.430651 -0.454975  1.583368  three
2023-08-08 -1.549326 -2.274574 -1.014404   four
2023-08-09 -0.300134  1.085409 -0.538089  seven

In [175]:
df

                   B         C         D      E
2023-08-04  0.144631  1.898931  0.688993    one
2023-08-05  0.559971 -0.342490  0.082496    one
2023-08-06  1.635320  0.157321 -1.475597    two
2023-08-07 -0.430651 -0.454975  1.583368  three
2023-08-08 -1.549326 -2.274574 -1.014404   four
2023-08-09 -0.300134  1.085409 -0.538089  seven

In [176]:
df.drop(columns='E' , inplace= True)

In [177]:
df

                   B         C         D
2023-08-04  0.144631  1.898931  0.688993
2023-08-05  0.559971 -0.342490  0.082496
2023-08-06  1.635320  0.157321 -1.475597
2023-08-07 -0.430651 -0.454975  1.583368
2023-08-08 -1.549326 -2.274574 -1.014404
2023-08-09 -0.300134  1.085409 -0.538089

In [178]:
def plus_minus(values):
    return 'plus' if values > 0 else 'mius'

- 함수를 만들고 .apply()에 대입하여 정보를 처리할 수 있다

In [179]:
df['B'].apply(plus_minus)

2023-08-04    plus
2023-08-05    plus
2023-08-06    plus
2023-08-07    mius
2023-08-08    mius
2023-08-09    mius
Freq: D, Name: B, dtype: object

In [180]:
df['B'] = df['B'].apply(plus_minus)

In [181]:
df

               B         C         D
2023-08-04  plus  1.898931  0.688993
2023-08-05  plus -0.342490  0.082496
2023-08-06  plus  0.157321 -1.475597
2023-08-07  mius -0.454975  1.583368
2023-08-08  mius -2.274574 -1.014404
2023-08-09  mius  1.085409 -0.538089

In [182]:
df

               B         C         D
2023-08-04  plus  1.898931  0.688993
2023-08-05  plus -0.342490  0.082496
2023-08-06  plus  0.157321 -1.475597
2023-08-07  mius -0.454975  1.583368
2023-08-08  mius -2.274574 -1.014404
2023-08-09  mius  1.085409 -0.538089

In [183]:
# 특정 값 수정
# loc
# iloc

In [186]:
df.loc['2023-08-06', 'C'] = 999

In [187]:
df

               B           C         D
2023-08-04  plus    1.898931  0.688993
2023-08-05  plus   -0.342490  0.082496
2023-08-06  plus  999.000000 -1.475597
2023-08-07  mius   -0.454975  1.583368
2023-08-08  mius   -2.274574 -1.014404
2023-08-09  mius    1.085409 -0.538089

In [188]:
df.iloc[4,2] = 111

In [189]:
df

               B           C           D
2023-08-04  plus    1.898931    0.688993
2023-08-05  plus   -0.342490    0.082496
2023-08-06  plus  999.000000   -1.475597
2023-08-07  mius   -0.454975    1.583368
2023-08-08  mius   -2.274574  111.000000
2023-08-09  mius    1.085409   -0.538089

In [193]:
df.loc['2023-08-06']

B        plus
C       999.0
D   -1.475597
Name: 2023-08-06 00:00:00, dtype: object

In [194]:
# left_df

# key 라는 이름의 컬럼
# key 컬럼의 값으로는 K0, K4, K2, K3

# A라는 이름의 컬럼
# A 컬럼의 값으로는 A0, A1, A2, A3

# B 라는 이름의 컬럼
# B 컬럼의 값으로는 B0, B1, B2, B3

In [3]:
left_data = {
    'key' : ['K0', 'K4', 'K2', 'K3'],
    'A' : ['A0', 'A1', 'A2', 'A3'],
    'B' : ['B0', 'B1', 'B2', 'B3']
}

In [6]:
import pandas as pd
left_df = pd.DataFrame(left_data)

In [7]:
# right_df

#key 라는 이름의 컬럼
# k0, K1, K2, K3
# C라는 이름의 컬럼
# C0, C1, C2,C3
# D라는 이름의 컬럼
# D0, D1, D2, D3

In [8]:
right_data = [
    {'key': 'K0', 'C': 'C0', 'D': 'D0'},
    {'key': 'K1', 'C': 'C1', 'D': 'D1'},
    {'key': 'K2', 'C': 'C2', 'D': 'D2'},
    {'key': 'K3', 'C': 'C3', 'D': 'D3'}
]

In [9]:
right_df = pd.DataFrame(right_data)
right_df

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [10]:
# merge
# 데이터 프레임을 가로로 병합

pd.merge(left_df, right_df, on  = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [11]:
## concat
## 세로로 병합
# NaN
# Not a Number
# 누락데이터, 누락값
nan_df = pd.concat([left_df, right_df])

In [12]:
nan_df

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3  NaN  NaN
0  K0  NaN  NaN   C0   D0
1  K1  NaN  NaN   C1   D1
2  K2  NaN  NaN   C2   D2
3  K3  NaN  NaN   C3   D3

In [13]:
nan_df.fillna('누락값')

  key    A    B    C    D
0  K0   A0   B0  누락값  누락값
1  K4   A1   B1  누락값  누락값
2  K2   A2   B2  누락값  누락값
3  K3   A3   B3  누락값  누락값
0  K0  누락값  누락값   C0   D0
1  K1  누락값  누락값   C1   D1
2  K2  누락값  누락값   C2   D2
3  K3  누락값  누락값   C3   D3

- 인덱스 정렬

In [14]:
nan_df.reset_index(drop=True, inplace=True)
nan_df

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3  NaN  NaN
4  K0  NaN  NaN   C0   D0
5  K1  NaN  NaN   C1   D1
6  K2  NaN  NaN   C2   D2
7  K3  NaN  NaN   C3   D3